In [1]:
import pandas as pd

print('Версия pandas:', pd.__version__)

Версия pandas: 2.1.4

# Поиск, извлечение и удаление дубликатов из структуры DataFrame

# Методы duplicated() и drop_duplicates()

    План урока
    
    1. Поиск, извлечение и подсчет дублирующихся строк: duplicated()
    - Базовое использование метода duplicated()
    - Выбор дубликатов для сохранения: аргумент keep
    - Указание столбцов для обнаружения дубликатов: аргумент subset
    - Подсчет дублирующихся и недублирующихся строк
    
    2. Удаление дубликатов: drop_duplicates()
    - Базовое использование метода drop_duplicates()
    - Выбор дубликатов для сохранения: аргумент keep
    - Указание столбцов для обнаружения дубликатов: аргумент subset
    - Сброс индекса: аргумент ignore_index
    - Изменение исходного объекта: аргумент inplace

In [2]:
df = pd.read_csv('files/sample_1.csv')
df.loc[6] = ['Dave', 68, 'TX', 70]
df

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57
6     Dave   68    TX     70

## Базовое использование метода duplicated()

In [3]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [4]:
df[df.duplicated()]

   name  age state  point
6  Dave   68    TX     70

## Выбор дубликатов для сохранения: аргумент keep

In [5]:
# По умолчанию (keep='first') отмечает все дубликаты строк как True, за исключением первого, который отмечается как False

display(df.duplicated(),
        # то же самое:
        df.duplicated(keep='first'))

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [6]:
# при установке keep='last' все дубликаты, кроме последнего, помечаются как True

df.duplicated(keep='last')

0    False
1    False
2    False
3     True
4    False
5    False
6    False
dtype: bool

In [7]:
# установка keep=False отмечает все дубликаты как True

df.duplicated(keep=False)

0    False
1    False
2    False
3     True
4    False
5    False
6     True
dtype: bool

## Указание столбцов для обнаружения дубликатов: аргумент subset

In [8]:
df

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57
6     Dave   68    TX     70

In [9]:
df.duplicated(subset='state')

0    False
1    False
2     True
3    False
4     True
5     True
6     True
dtype: bool

In [10]:
df.duplicated(subset=['state', 'point'])

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

## Подсчет дублирующихся и недублирующихся строк

In [11]:
# вычисляем количество дубликатов

df.duplicated().sum()

1

In [12]:
# находим недублирующиеся строки

~df.duplicated()

0     True
1     True
2     True
3     True
4     True
5     True
6    False
dtype: bool

In [13]:
# вычисляем количество недублирующихся строк

(~df.duplicated()).sum()

6

In [14]:
# вычисляем количество дублирующихся и недублирующихся строк одновременно

df.duplicated().value_counts()

False    6
True     1
Name: count, dtype: int64

In [15]:
df.duplicated(keep=False).value_counts()

False    5
True     2
Name: count, dtype: int64

## Удаление дубликатов строк: drop_duplicates()

## Базовое использование метода drop_duplicates()

In [16]:
df.drop_duplicates()

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

In [17]:
df

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57
6     Dave   68    TX     70

## Выбор дубликатов для сохранения: аргумент keep

- keep='first' (по умолчанию) сохраняет ПЕРВОЕ вхождение каждой дублирующейся строки
- keep='last' сохраняет ПОСЛЕДНЕЕ вхождение каждой дублирующейся строки
- Установка keep=False удаляет ВСЕ ВХОЖДЕНИЯ ДУБЛИКАТОВ

In [18]:
df.drop_duplicates(keep='last')

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
4    Ellen   24    CA     88
5    Frank   30    NY     57
6     Dave   68    TX     70

In [19]:
df.drop_duplicates(keep=False)

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

## Указание столбцов для обнаружения дубликатов: аргумент subset

In [20]:
df.drop_duplicates(subset='state')

    name  age state  point
0  Alice   24    NY     64
1    Bob   42    CA     92
3   Dave   68    TX     70

In [21]:
df.drop_duplicates(subset=['state', 'point'])

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

## Сброс индекса: аргумент ignore_index

In [22]:
df.drop_duplicates(subset='state', keep='last')

    name  age state  point
4  Ellen   24    CA     88
5  Frank   30    NY     57
6   Dave   68    TX     70

In [23]:
df.drop_duplicates(subset='state', keep='last', ignore_index=True)

    name  age state  point
0  Ellen   24    CA     88
1  Frank   30    NY     57
2   Dave   68    TX     70

## Изменение исходного объекта: аргумент inplace

In [24]:
df.drop_duplicates(subset='state', keep='last', inplace=True)
df

    name  age state  point
4  Ellen   24    CA     88
5  Frank   30    NY     57
6   Dave   68    TX     70